-- phpMyAdmin SQL Dump
-- version 4.4.15.7
-- http://www.phpmyadmin.net
--
-- Хост: 127.0.0.1:3306
-- Время создания: Сен 12 2016 г., 15:24
-- Версия сервера: 5.5.50
-- Версия PHP: 5.6.23

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- База данных: `movies`
--

-- --------------------------------------------------------

--
-- Структура таблицы `catalog`
--

CREATE TABLE IF NOT EXISTS `catalog` (
  `id` int(11) unsigned NOT NULL,
  `title` varchar(255) CHARACTER SET utf8 NOT NULL,
  `genre` varchar(255) CHARACTER SET utf8 NOT NULL,
  `country` varchar(255) CHARACTER SET utf8 NOT NULL,
  `releaseyear` int(11) unsigned NOT NULL,
  `price` int(11) unsigned NOT NULL,
  `store quantity` int(11) unsigned NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=6 DEFAULT CHARSET=utf32;

--
-- Дамп данных таблицы `catalog`
--

INSERT INTO `catalog` (`id`, `title`, `genre`, `country`, `releaseyear`, `price`, `store quantity`) VALUES
(1, 'Властелин колец: Братство кольца', 'фэнтези', 'США', 2001, 150, 18),
(2, 'Принц Египта', 'Исторический', 'США', 1998, 100, 42),
(3, 'Собачье сердце', 'Исторический', 'СССР', 1988, 125, 13),
(4, 'Леон', 'Триллер', 'Франция', 1994, 140, 26),
(5, 'Особенности национальной охоты', 'Комедия', 'Россия', 1995, 110, 13);

-- --------------------------------------------------------

--
-- Структура таблицы `orders`
--

CREATE TABLE IF NOT EXISTS `orders` (
  `id` int(11) unsigned NOT NULL,
  `title` varchar(255) CHARACTER SET utf8 NOT NULL,
  `genre` varchar(255) NOT NULL,
  `country` varchar(255) CHARACTER SET utf8 NOT NULL,
  `releaseyear` int(11) unsigned NOT NULL,
  `price` int(11) unsigned NOT NULL,
  `quantity` int(11) unsigned NOT NULL,
  `orderid` varchar(255) CHARACTER SET utf8 NOT NULL,
  `datetime` int(11) unsigned NOT NULL
) ENGINE=InnoDB AUTO_INCREMENT=53 DEFAULT CHARSET=utf32;

--
-- Дамп данных таблицы `orders`
--

INSERT INTO `orders` (`id`, `title`, `genre`, `country`, `releaseyear`, `price`, `quantity`, `orderid`, `datetime`) VALUES
(1, 'Принц Египта', 'Исторический', 'США', 1998, 100, 1, '57d580dff193c', 1473609999),
(2, 'Собачье сердце', 'Исторический', 'СССР', 1988, 125, 1, '57d580dff193c', 1473609999),
(3, 'Властелин колец: Братство кольца', 'фэнтези', 'США', 2001, 150, 1, '57d58110b67ec', 1473610012),
(4, 'Леон', 'Триллер', 'Франция', 1994, 140, 1, '57d58110b67ec', 1473610012),
(5, 'Властелин колец: Братство кольца', 'фэнтези', 'США', 2001, 150, 1, '57d5811e2579c', 1473610034),
(6, 'Принц Египта', 'Исторический', 'США', 1998, 100, 1, '57d5811e2579c', 1473610034),
(7, 'Леон', 'Триллер', 'Франция', 1994, 140, 1, '57d5811e2579c', 1473610034),
(8, 'Властелин колец: Братство кольца', 'фэнтези', 'США', 2001, 150, 1, '57d58133c330c', 1473610058),
(9, 'Принц Египта', 'Исторический', 'США', 1998, 100, 1, '57d58133c330c', 1473610058),
(10, 'Собачье сердце', 'Исторический', 'СССР', 1988, 125, 1, '57d58133c330c', 1473610058),
(11, 'Леон', 'Триллер', 'Франция', 1994, 140, 1, '57d58133c330c', 1473610058),
(12, 'Властелин колец: Братство кольца', 'фэнтези', 'США', 2001, 150, 4, '57d5814bf3c64', 1473661100),
(13, 'Принц Египта', 'Исторический', 'США', 1998, 100, 5, '57d5814bf3c64', 1473661100),
(14, 'Собачье сердце', 'Исторический', 'СССР', 1988, 125, 6, '57d5814bf3c64', 1473661100),
(15, 'Особенности национальной охоты', 'Комедия', 'Россия', 1995, 110, 15, '57d5814bf3c64', 1473661100),
(16, 'Собачье сердце', 'Исторический', 'СССР', 1988, 125, 1, '57d55a02c65d4', 1473669333),
(17, 'Принц Египта', 'Исторический', 'США', 1998, 100, 6, '57d55a02c65d4', 1473670747),
(18, 'Леон', 'Триллер', 'Франция', 1994, 140, 5, '57d55a02c65d4', 1473670747),
(19, 'Особенности национальной охоты', 'Комедия', 'Россия', 1995, 110, 3, '57d55a02c65d4', 1473670747),
(20, 'Принц Египта', 'Исторический', 'США', 1998, 100, 6, '57d55a02c65d4', 1473670866),
(21, 'Леон', 'Триллер', 'Франция', 1994, 140, 5, '57d55a02c65d4', 1473670866),
(22, 'Особенности национальной охоты', 'Комедия', 'Россия', 1995, 110, 3, '57d55a02c65d4', 1473670866),
(23, 'Принц Египта', 'Исторический', 'США', 1998, 100, 6, '57d55a02c65d4', 1473670883),
(24, 'Леон', 'Триллер', 'Франция', 1994, 140, 5, '57d55a02c65d4', 1473670883),
(25, 'Особенности национальной охоты', 'Комедия', 'Россия', 1995, 110, 3, '57d55a02c65d4', 1473670883),
(26, 'Принц Египта', 'Исторический', 'США', 1998, 100, 6, '57d55a02c65d4', 1473670952),
(27, 'Леон', 'Триллер', 'Франция', 1994, 140, 5, '57d55a02c65d4', 1473670952),
(28, 'Особенности национальной охоты', 'Комедия', 'Россия', 1995, 110, 3, '57d55a02c65d4', 1473670952),
(29, 'Принц Египта', 'Исторический', 'США', 1998, 100, 6, '57d55a02c65d4', 1473671032),
(30, 'Леон', 'Триллер', 'Франция', 1994, 140, 5, '57d55a02c65d4', 1473671032),
(31, 'Особенности национальной охоты', 'Комедия', 'Россия', 1995, 110, 3, '57d55a02c65d4', 1473671032),
(32, 'Принц Египта', 'Исторический', 'США', 1998, 100, 6, '57d55a02c65d4', 1473671340),
(33, 'Леон', 'Триллер', 'Франция', 1994, 140, 5, '57d55a02c65d4', 1473671340),
(34, 'Особенности национальной охоты', 'Комедия', 'Россия', 1995, 110, 3, '57d55a02c65d4', 1473671340),
(35, 'Принц Египта', 'Исторический', 'США', 1998, 100, 6, '57d55a02c65d4', 1473671903),
(36, 'Леон', 'Триллер', 'Франция', 1994, 140, 5, '57d55a02c65d4', 1473671903),
(37, 'Особенности национальной охоты', 'Комедия', 'Россия', 1995, 110, 3, '57d55a02c65d4', 1473671903),
(38, 'Властелин колец: Братство кольца', 'фэнтези', 'США', 2001, 150, 3, '57d672df96e10', 1473672107),
(39, 'Принц Египта', 'Исторический', 'США', 1998, 100, 4, '57d672df96e10', 1473672107),
(40, 'Властелин колец: Братство кольца', 'фэнтези', 'США', 2001, 150, 6, '57d673ab18a88', 1473672383),
(41, 'Властелин колец: Братство кольца', 'фэнтези', 'США', 2001, 150, 3, '57d674bf77240', 1473672750),
(42, 'Принц Египта', 'Исторический', 'США', 1998, 100, 9, '57d674bf77240', 1473672750),
(43, 'Леон', 'Триллер', 'Франция', 1994, 140, 11, '57d674bf77240', 1473672750),
(44, 'Особенности национальной охоты', 'Комедия', 'Россия', 1995, 110, 5, '57d674bf77240', 1473672750),
(45, 'Властелин колец: Братство кольца', 'фэнтези', 'США', 2001, 150, 3, '57d6762ea21c0', 1473673917),
(46, 'Принц Египта', 'Исторический', 'США', 1998, 100, 9, '57d6762ea21c0', 1473673917),
(47, 'Леон', 'Триллер', 'Франция', 1994, 140, 11, '57d6762ea21c0', 1473673917),
(48, 'Особенности национальной охоты', 'Комедия', 'Россия', 1995, 110, 2, '57d6762ea21c0', 1473673917),
(49, 'Принц Египта', 'Исторический', 'США', 1998, 100, 1, '57d6762ea21c0', 1473675431),
(50, 'Собачье сердце', 'Исторический', 'СССР', 1988, 125, 2, '57d6762ea21c0', 1473675431),
(51, 'Принц Египта', 'Исторический', 'США', 1998, 100, 2, '57d680a723668', 1473675777),
(52, 'Леон', 'Триллер', 'Франция', 1994, 140, 3, '57d680a723668', 1473675777);

--
-- Индексы сохранённых таблиц
--

--
-- Индексы таблицы `catalog`
--
ALTER TABLE `catalog`
  ADD PRIMARY KEY (`id`);

--
-- Индексы таблицы `orders`
--
ALTER TABLE `orders`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT для сохранённых таблиц
--

--
-- AUTO_INCREMENT для таблицы `catalog`
--
ALTER TABLE `catalog`
  MODIFY `id` int(11) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=6;
--
-- AUTO_INCREMENT для таблицы `orders`
--
ALTER TABLE `orders`
  MODIFY `id` int(11) unsigned NOT NULL AUTO_INCREMENT,AUTO_INCREMENT=53;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
